javascript/projects/ajax_twitter/solution/app/controllers/feeds_controller.rb

SELECT "mentions".* FROM "mentions"  WHERE "mentions"."tweet_id" = $1  [["tweet_id", 284]]
SELECT "users".* FROM "users"
---
  def show
    @feed_tweets =
      current_user.feed_tweets(LIMIT, params[:max_created_at]).includes(:user, :mentions)