javascript/projects/ajax_twitter/solution/app/controllers/tweets_controller.rb

  def create
    # simulate latency
    sleep(1)

    @tweet = current_user.tweets.build(tweet_params)

    if @tweet.save
---
INSERT INTO "tweets" ("content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "adsfasdfsadfsdfdsaf"], ["created_at", "2016-06-01 18:27:41.562507"], ["updated_at", "2016-06-01 18:27:41.562507"], ["user_id", 8]]