javascript/projects/ajax_twitter/solution/app/views/tweets/_form.html.erb

        <select name="tweet[mentioned_user_ids][]">
          <% User.all.each do |user| %>
---
SELECT "users".* FROM "users"