react/projects/pokedex/solution/app/controllers/api/pokemon_controller.rb

INSERT INTO "pokemons" ("image_url", "attack", "defense", "name", "poke_type", "moves", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    pokemon = Pokemon.new(pokemon_params)

    if pokemon.save

SELECT "pokemons".* FROM "pokemons"
---
  def index
    sleep 1
    pokemon_hash = {}
    Pokemon.all.each do |pokemon|

SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    sleep 1
    pokemon = Pokemon.find(params[:id])